package pro.fateeva.spacechucha.repository

class FactsRepositoryImpl : FactsRepository {
    override fun getFacts(): List<String> = listOf(
        "1. 4 октября 1957 году был запущен первый спутник, пролетавший всего 92 дня.",
        "2. 480 градусов Цельсия составляет температура на поверхности Венеры.",
        "3. Во Вселенной огромное количество галактик, которых невозможно сосчитать.",
        "4. С декабря 1972 года на Луне не было людей.",
        "5. Гораздо медленнее идет время рядом с объектами с большой силой гравитации.",
        "6. Одновременно замерзают и кипят все жидкости в космосе. Даже моча.",
        "7. Туалеты в космосе для безопасности космонавтов оборудованы специальными защитными ремнями для бедер и ступней.",
        "8. После захода солнца невооруженным глазом можно увидеть космическую международную станцию(МКС), которая вращается вокруг Земли.",
        "9. Космонавты носят подгузники при посадке, взлете и при выходе в открытый космос.",
        "10. Учение считают, что Луна является огромным куском, который образовался при столкновении Земли с другой планетой.",
        "11.Одна комета, попав в солнечную бурю, потеряла свой хвост.",
        "12. На спутнике Юпитера находится крупнейший вулкан Пеле.",
        "13. Белые карлики — так называются звезды, которые лишены собственных источников термоядерной энергии.",
        "14. за секунду солнце теряет 4000 тонн веса. за минуту, за минуту 240 тыс тонн.",
        "15. Согласно теории «Большого взрыва» вселенная возникла примерно 13,77 млрд лет назад из некоторого сингулярного состояния и с тех пор все время расширяется.",
        "16. На расстоянии 13 миллионов световых лет от земли находится известная черная дыра.",
        "17. Вокруг Солнца вращаются девять планет, которые имеют собственные спутники.",
        "18. Картофель по форме напоминает спутники Марса.",
        "19. Первым путешественником во времени стал космонавт Сергей Авдеев. Он длительное время вращался на орбите земли со скоростью 27000 км/ч, В связи с этим попал на 0,02 секунды в будущее.",
        "20. 9,46 триллиона километров — это расстояние, которое свет преодолевает за один год.",
        "21. Времена года отсутствуют на Юпитере. В связи с тем что угол наклона оси вращения относительно плоскости орбиты составляет только 3,13°. Также минимальна степень отклонения орбиты от окружности планеты (0,05)",
        "22. Еще ни разу никого не убил падающий метеорит.",
        "23. Маленькими астрономическими телами называются астероиды, вращающиеся вокруг Солнца.",
        "24. 98% массы всех объектов Солнечной Системы составляет масса Солнца.",
        "25. В 34 миллиарда раз выше атмосферное давление в центре Солнца, по сравнению с давлением на уровне моря на Земле.",
        "26. Около 6000 градусов по Цельсию составляет температура на поверхности Солнца.",
        "27. В 2014 году была обнаружена самая холодная звезда класса «белые карлики», углерод на ней кристаллизовался и вся звезда превратилась в бриллиант размером с Землю.",
        "28. Итальянский астроном Галилео скрывался от преследования римской католической церкви.",
        "29. За 8 минут свет достигает поверхности Земли.",
        "30. Солнце сильно увеличится в размерах примерно через миллиард лет. В то время когда закончится весь водород в ядре солнца. Горение будет происходить на поверхности и светить станет намного ярче."
    )
}